---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.ElementsAlreadyHaveParts
source: html/783eeb1b-afcd-8095-c5ba-89a4c3f62651.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.ElementsAlreadyHaveParts Property

Some elements already have parts

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsAlreadyHaveParts { get; }
```